In [116]:
# Import Dependencies
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import seaborn as sns

In [117]:
#call raw data files
city_path= "raw_data/city_data.csv"
ride_path = "raw_data/ride_data.csv"

#read raw data files into dataframes
city_data = pd.read_csv(city_path)
ride_data = pd.read_csv(ride_path)

#sorted_city_data = city_data.sort("city", inplace = True)

city_data_df = pd.DataFrame(city_data)
ride_data_df = pd.DataFrame(ride_data)

#Attempted to ort these by city name... hasn't been working
#city_data_df = city_data_df.sort_values("city", inplace = True)
#ride_data_df = ride_data_df.sort_values("city", inplace = True)

#preview the data frame
city_data_df.head()

             city  driver_count   type
0      Kelseyland            63  Urban
1      Nguyenbury             8  Urban
2    East Douglas            12  Urban
3   West Dawnfurt            34  Urban
4  Rodriguezburgh            52  Urban

In [118]:
#preview the data frame
ride_data_df.head()

          city                 date   fare        ride_id
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673

In [119]:
all_data = pd.merge(ride_data, city_data, how="outer", on="city")

#compare the length of all_data and ride_data... it looks like there are 32 cities with no ride data, so they have blank rows
#(due to the outer join)
print(len(all_data))
print(len(ride_data))
all_data.head()

2407
2375

       city                 date   fare        ride_id  driver_count   type
0  Sarabury  2016-01-16 13:49:27  38.35  5403689035038            46  Urban
1  Sarabury  2016-07-23 07:42:44  21.76  7546681945283            46  Urban
2  Sarabury  2016-04-02 04:32:25  38.03  4932495851866            46  Urban
3  Sarabury  2016-06-23 05:03:41  26.82  6711035373406            46  Urban
4  Sarabury  2016-09-30 12:48:34  30.30  6388737278232            46  Urban

In [120]:
#calculate the average fare by city
average_fare = all_data.groupby(["city"]).mean()["fare"]
print(len(average_fare))
average_fare.head()

125

city
Alvarezhaven    23.928710
Alyssaberg      20.609615
Anitamouth      37.315556
Antoniomouth    23.625000
Aprilchester    21.981579
Name: fare, dtype: float64

In [121]:
#determine the number of rides by city
ride_numbers = all_data.groupby(["city"]).count()["fare"]
print(len(ride_numbers))
ride_numbers.head()

125

city
Alvarezhaven    31
Alyssaberg      26
Anitamouth       9
Antoniomouth    22
Aprilchester    19
Name: fare, dtype: int64

In [122]:
driver_count = all_data.groupby(["city"]).mean()["driver_count"]
print(len(driver_count))
driver_count.head()

125

city
Alvarezhaven    21.0
Alyssaberg      67.0
Anitamouth      16.0
Antoniomouth    21.0
Aprilchester    49.0
Name: driver_count, dtype: float64

In [130]:
#what is going on here? I can't get city_data sorted, and can't pull the specific columns that I want
city_type = city_data_df["driver_count"]
city_type.head()

0    63
1     8
2    12
3    34
4    52
Name: driver_count, dtype: int64